7767517
12 12
Input            in0                      0 1 in0
Convolution1D      node_Conv_23             1 1 in0 getitem 0=16 1=3 2=1 3=1 4=1 5=1 6=192
ReLU             node_relu                1 1 getitem relu
Pooling1D        node_max_pool1d          1 1 relu max_pool1d 0=0 1=2 2=2 3=0 13=0 5=1
Convolution1D      node_Conv_24             1 1 max_pool1d getitem_3 0=32 1=3 2=1 3=1 4=1 5=1 6=1536
ReLU             node_relu_1              1 1 getitem_3 relu_1
Pooling1D        node_max_pool1d_1        1 1 relu_1 max_pool1d_1 0=0 1=2 2=2 3=0 13=0 5=1
Reshape          node_view                1 1 max_pool1d_1 view 0=480
InnerProduct     node_linear              1 1 view linear 0=128 1=1 2=61440
ReLU             node_relu_2              1 1 linear relu_2
InnerProduct     node_linear_1            1 1 relu_2 linear_1 0=90 1=1 2=11520
Reshape          node_view_1              1 1 linear_1 out0 0=30 1=3
